#### DataFrames

1) Data Frames are data displayed in a format as a table.<br>
2) Table will bear row and column<br>
3) We can have hetrogeneous data in dataframe unlike matrix<br>
4) However, each column will bear same data type<br>

#### Creating DataFrame using vectors

In [1]:
names <- c('Ankit','Raj','Hitesh','Shubham','Radhika','Prajakta','Nikita')
age <-  c(20,22,NA,23,24,23,22)
city <- c('Delhi','Noida','Pune',NA,'Nagpur','Mumbai','Delhi')

df1 <- data.frame(names,age,city)
print(class(df1))
df1

[1] "data.frame"

  names    age city
1 Ankit    20  Delhi
2 Raj      22  Noida
3 Hitesh   NA  Pune
4 Shubham  23  NA
5 Radhika  24  Nagpur
6 Prajakta 23  Mumbai
7 Nikita   22  Delhi

In [4]:
View(df1)  # not supported yet in Jupyter

ERROR: Error in View(df1): 'View()' not yet supported in the Jupyter R kernel

In [5]:
str(df1)

'data.frame':	7 obs. of  3 variables:
 $ names: Factor w/ 7 levels "Ankit","Hitesh",..: 1 6 2 7 5 4 3
 $ age  : num  20 22 NA 23 24 23 22
 $ city : Factor w/ 5 levels "Delhi","Mumbai",..: 1 4 5 NA 3 2 1

In [79]:
df1[str(df1)=='Factor']

'data.frame':	7 obs. of  4 variables:
 $ Names: Factor w/ 7 levels "Ankit","Hitesh",..: 1 6 2 7 5 4 3
 $ Age  : num  20 22 NA 23 24 23 22
 $ City : Factor w/ 5 levels "Delhi","Mumbai",..: 1 4 5 NA 3 2 1
 $ Dept : chr  "IT" "Finance" "Operations" "HR" ...

1
2
3
4
5
6
7

In [6]:
summary(df1)  
# df.describe()

      names        age            city
 Ankit   :1   Min.   :20.00   Delhi :2
 Hitesh  :1   1st Qu.:22.00   Mumbai:1
 Nikita  :1   Median :22.50   Nagpur:1
 Prajakta:1   Mean   :22.33   Noida :1
 Radhika :1   3rd Qu.:23.00   Pune  :1
 Raj     :1   Max.   :24.00   NA's  :1
 Shubham :1   NA's   :1

In [7]:
summary(df1$age)  
# df['a'].describe()

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.    NA's
  20.00   22.00   22.50   22.33   23.00   24.00       1

#### head,tail and sample

In [8]:
head(df1,3) # by default top 6 rows

  names  age city
1 Ankit  20  Delhi
2 Raj    22  Noida
3 Hitesh NA  Pune

In [9]:
tail(df1,4)  # bottom 6 rows

  names    age city
4 Shubham  23  NA
5 Radhika  24  Nagpur
6 Prajakta 23  Mumbai
7 Nikita   22  Delhi

In [17]:
library(tidyverse)
library(dplyr)

In [24]:
sample_n(df1,3)  # returns random n rows,
# sample_n is a function from dplyr package

  names    age city
1 Ankit    20  Delhi
2 Shubham  23  NA
3 Prajakta 23  Mumbai

#### Fetching a single column

In [19]:
# Method-1
print(df1$names)  # factor
print(df1$age)    # num
print(df1$city)   # factor

[1] Ankit    Raj      Hitesh   Shubham  Radhika  Prajakta Nikita
Levels: Ankit Hitesh Nikita Prajakta Radhika Raj Shubham
[1] 20 22 NA 23 24 23 22
[1] Delhi  Noida  Pune   <NA>   Nagpur Mumbai Delhi
Levels: Delhi Mumbai Nagpur Noida Pune

In [35]:
#### Method - 2
df1['names']

  names
1 Ankit
2 Raj
3 Hitesh
4 Shubham
5 Radhika
6 Prajakta
7 Nikita

In [25]:
df1[['age']]

[1] 20 22 NA 23 24 23 22

In [26]:
print(class(df1[['age']]))
print(class(df1['age']))  #  a single column from a data.frame is a dataframe in R

[1] "numeric"
[1] "data.frame"

#### Fetching multiple columns

In [27]:
df1

  names    age city
1 Ankit    20  Delhi
2 Raj      22  Noida
3 Hitesh   NA  Pune
4 Shubham  23  NA
5 Radhika  24  Nagpur
6 Prajakta 23  Mumbai
7 Nikita   22  Delhi

In [28]:
df1[2,3]

[1] Noida
Levels: Delhi Mumbai Nagpur Noida Pune

In [29]:
df1[2,]  # accessing row num 2

  names age city
2 Raj   22  Noida

In [30]:
df1[,3]

[1] Delhi  Noida  Pune   <NA>   Nagpur Mumbai Delhi
Levels: Delhi Mumbai Nagpur Noida Pune

In [31]:
# Method - 1
df1[,1:2]  # accessing col1 and col2

  names    age
1 Ankit    20
2 Raj      22
3 Hitesh   NA
4 Shubham  23
5 Radhika  24
6 Prajakta 23
7 Nikita   22

In [32]:
df1[1:3,c(1,3)]

  names  city
1 Ankit  Delhi
2 Raj    Noida
3 Hitesh Pune

In [33]:
df1

  names    age city
1 Ankit    20  Delhi
2 Raj      22  Noida
3 Hitesh   NA  Pune
4 Shubham  23  NA
5 Radhika  24  Nagpur
6 Prajakta 23  Mumbai
7 Nikita   22  Delhi

In [34]:
# row=5, col=2
df1[5,2]

[1] 24

In [35]:
df1[2,'city']  # row num, column name

[1] Noida
Levels: Delhi Mumbai Nagpur Noida Pune

#### Import libraries

In [36]:
library(tidyverse)
library(dplyr)

In [37]:
# select function is imported from dplyr
select(df1,city, names)

  city   names
1 Delhi  Ankit
2 Noida  Raj
3 Pune   Hitesh
4 NA     Shubham
5 Nagpur Radhika
6 Mumbai Prajakta
7 Delhi  Nikita

In [60]:
select(df1,c(1,2))

  names    age
1 Ankit    20
2 Raj      22
3 Hitesh   NA
4 Shubham  23
5 Radhika  24
6 Prajakta 23
7 Nikita   22

In [39]:
head(select(df1, city,names),5)

  city   names
1 Delhi  Ankit
2 Noida  Raj
3 Pune   Hitesh
4 NA     Shubham
5 Nagpur Radhika

#### Filtering a DataFrame

In [44]:
df1_new = subset(df1, df1$city == "Delhi")
df1_new

  names  age city
1 Ankit  20  Delhi
7 Nikita 22  Delhi

#### Adding a new column

In [45]:
colnames(df1)
dim(df1)

[1] "names" "age"   "city"

[1] 7 3

In [46]:
df1$dept <- c("IT","Finance","Operations","HR","Admin","IT","Finance")
colnames(df1)

[1] "names" "age"   "city"  "dept"

In [47]:
head(df1)

  names    age city   dept
1 Ankit    20  Delhi  IT
2 Raj      22  Noida  Finance
3 Hitesh   NA  Pune   Operations
4 Shubham  23  NA     HR
5 Radhika  24  Nagpur Admin
6 Prajakta 23  Mumbai IT

#### Add new rows (Append a new dataframe)

#### 1) Create a new dataframe

In [48]:
names <- c('Vibhor','Litika')
age <-  c(23,24)
city <- c('Mumbai','Delhi')
dept <- c('IT','HR')

df2 <- data.frame(names,age,city,dept)
df2

  names  age city   dept
1 Vibhor 23  Mumbai IT
2 Litika 24  Delhi  HR

#### 2) rbind the 2 dataframes

In [49]:
df_res <- rbind(df1,df2)
df_res

  names    age city   dept
1 Ankit    20  Delhi  IT
2 Raj      22  Noida  Finance
3 Hitesh   NA  Pune   Operations
4 Shubham  23  NA     HR
5 Radhika  24  Nagpur Admin
6 Prajakta 23  Mumbai IT
7 Nikita   22  Delhi  Finance
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

#### Check num of rows, num of cols, shape of dataframe

In [56]:
print(nrow(df_res))   # num of rows
print(ncol(df_res))   # num of cols
print(dim(df_res))      # num of rows and cols
print(colnames(df_res)) # column names

[1] 9
[1] 4
[1] 9 4
[1] "names" "age"   "city"  "dept"

#### Rename columns

In [57]:
colnames(df_res) <- c('Names','Age','City','Dept')
head(df_res,3)

  Names  Age City  Dept
1 Ankit  20  Delhi IT
2 Raj    22  Noida Finance
3 Hitesh NA  Pune  Operations

#### Value Counts

In [114]:
print(table(df_res$City))   # value_counts
print(unique(df_res$City))  # unique
print(length(unique(df_res$City)))  # nunique

 Delhi Mumbai Nagpur  Noida   Pune
     3      2      1      1      1
[1] Delhi  Noida  Pune   <NA>   Nagpur Mumbai
Levels: Delhi Mumbai Nagpur Noida Pune
[1] 6

In [72]:
colnames(df_res)

[1] "Names" "Age"   "City"  "Dept"

#### Fetching col names for multiple categorical columns

In [80]:
for (i in colnames(df_res[c(3,4)])){
    print(table(df_res[i]))
}

 Delhi Mumbai Nagpur  Noida   Pune
     3      2      1      1      1

     Admin    Finance         HR         IT Operations
         1          2          2          3          1

#### Check null values

In [58]:
colSums(is.na(df_res))

Names   Age  City  Dept
    0     1     1     0

In [60]:
library(tidyr)
# contains functions like -  fill, apply, filter

In [62]:
head(select(df_res,Names,Age,City))a

  Names    Age City
1 Ankit    20  Delhi
2 Raj      22  Noida
3 Hitesh   NA  Pune
4 Shubham  23  NA
5 Radhika  24  Nagpur
6 Prajakta 23  Mumbai

#### Pipe function (%>%) 
piping operation<br>
used to combine functions in R<br>
It takes the output of one function and passes it into another function as an argument. This allows us to link a sequence of analysis steps.

#### Fill null values using up (bottom value will replace top value) - 
equivalent to df[col].fillna(method='bfill') in python

In [63]:
df_upfill <- df_res%>%fill(Age, .direction = 'up')
df_upfill

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
2 Raj      22  Noida  Finance
3 Hitesh   23  Pune   Operations
4 Shubham  23  NA     HR
5 Radhika  24  Nagpur Admin
6 Prajakta 23  Mumbai IT
7 Nikita   22  Delhi  Finance
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

#### Fill null values using down (top value will replace bottom value) - 
equivalent to df[col].fillna(method='mfill') in python

In [64]:
df_downfill <- df_res %>% fill(City, .direction = 'down')
df_downfill

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
2 Raj      22  Noida  Finance
3 Hitesh   NA  Pune   Operations
4 Shubham  23  Pune   HR
5 Radhika  24  Nagpur Admin
6 Prajakta 23  Mumbai IT
7 Nikita   22  Delhi  Finance
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

#### Creating a copy of dataframe

In [66]:
# Used to check memory address
tracemem(df_res)

[1] "<00000000059325C0>"

In [67]:
df_res2 <- data.frame(df_res)            # Create copy of data
colnames(df_res2)

[1] "Names" "Age"   "City"  "Dept"

In [68]:
tracemem(df_res) == tracemem(df_res2)

[1] FALSE

In [69]:
colSums(is.na(df_res2))

tracemem[0x00000000045f5ec0 -> 0x000000000f456708]: as.list.data.frame as.list lapply do.call is.na.data.frame is.na is.data.frame colSums eval eval withVisible withCallingHandlers doTryCatch tryCatchOne tryCatchList tryCatch try handle timing_fn evaluate_call evaluate doTryCatch tryCatchOne tryCatchList doTryCatch tryCatchOne tryCatchList tryCatch <Anonymous> handle_shell <Anonymous> <Anonymous>

Names   Age  City  Dept
    0     1     1     0

In [85]:
mean(df_upfill$Age)

[1] 22.66667

In [81]:
colnames(df_res2)

[1] "Names" "Age"   "City"  "Dept"

In [97]:
df3 <- data.frame(df_res)            # Create copy of data
colnames(df3)

[1] "Names" "Age"   "City"  "Dept"

In [98]:
colSums(is.na(df3))

Names   Age  City  Dept
    0     1     1     0

#### Replacing Null vlaues with Mean

In [99]:
df4 <- df3 %>% mutate(Age = replace_na(Age,mean(Age,na.rm=TRUE)))
df4

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
2 Raj      22.000 Noida  Finance
3 Hitesh   22.625 Pune   Operations
4 Shubham  23.000 NA     HR
5 Radhika  24.000 Nagpur Admin
6 Prajakta 23.000 Mumbai IT
7 Nikita   22.000 Delhi  Finance
8 Vibhor   23.000 Mumbai IT
9 Litika   24.000 Delhi  HR

In [100]:
colSums(is.na(df4))

Names   Age  City  Dept
    0     0     1     0

In [107]:
df4 <- df4 %>% mutate(City = replace_na(City,'Mumbai'))
df4

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
2 Raj      22.000 Noida  Finance
3 Hitesh   22.625 Pune   Operations
4 Shubham  23.000 Mumbai HR
5 Radhika  24.000 Nagpur Admin
6 Prajakta 23.000 Mumbai IT
7 Nikita   22.000 Delhi  Finance
8 Vibhor   23.000 Mumbai IT
9 Litika   24.000 Delhi  HR

In [109]:
colSums(is.na(df4))

Names   Age  City  Dept
    0     0     0     0

#### Sorting in DataFrame

In [115]:
colnames(df4)

[1] "Names" "Age"   "City"  "Dept"

In [120]:
df4

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
2 Raj      22.000 Noida  Finance
3 Hitesh   22.625 Pune   Operations
4 Shubham  23.000 Mumbai HR
5 Radhika  24.000 Nagpur Admin
6 Prajakta 23.000 Mumbai IT
7 Nikita   22.000 Delhi  Finance
8 Vibhor   23.000 Mumbai IT
9 Litika   24.000 Delhi  HR

In [128]:
df4[order(df4$Age),] # by default, decreasing = FALSE

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
2 Raj      22.000 Noida  Finance
7 Nikita   22.000 Delhi  Finance
3 Hitesh   22.625 Pune   Operations
4 Shubham  23.000 Mumbai HR
6 Prajakta 23.000 Mumbai IT
8 Vibhor   23.000 Mumbai IT
5 Radhika  24.000 Nagpur Admin
9 Litika   24.000 Delhi  HR

In [130]:
df4[order(df4$Age, decreasing = FALSE),]

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
2 Raj      22.000 Noida  Finance
7 Nikita   22.000 Delhi  Finance
3 Hitesh   22.625 Pune   Operations
4 Shubham  23.000 Mumbai HR
6 Prajakta 23.000 Mumbai IT
8 Vibhor   23.000 Mumbai IT
5 Radhika  24.000 Nagpur Admin
9 Litika   24.000 Delhi  HR

In [131]:
df4[order(df4$City, decreasing = FALSE),]

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
7 Nikita   22.000 Delhi  Finance
9 Litika   24.000 Delhi  HR
4 Shubham  23.000 Mumbai HR
6 Prajakta 23.000 Mumbai IT
8 Vibhor   23.000 Mumbai IT
5 Radhika  24.000 Nagpur Admin
2 Raj      22.000 Noida  Finance
3 Hitesh   22.625 Pune   Operations

In [134]:
df4[order(df4$City,df4$Age,df4$Names),]

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
7 Nikita   22.000 Delhi  Finance
9 Litika   24.000 Delhi  HR
6 Prajakta 23.000 Mumbai IT
4 Shubham  23.000 Mumbai HR
8 Vibhor   23.000 Mumbai IT
5 Radhika  24.000 Nagpur Admin
2 Raj      22.000 Noida  Finance
3 Hitesh   22.625 Pune   Operations

In [141]:
# Method - 2
arrange(df4, Age,desc(City))    # Age wise city in descending order

  Names    Age    City   Dept
1 Ankit    20.000 Delhi  IT
2 Raj      22.000 Noida  Finance
3 Nikita   22.000 Delhi  Finance
4 Hitesh   22.625 Pune   Operations
5 Shubham  23.000 Mumbai HR
6 Prajakta 23.000 Mumbai IT
7 Vibhor   23.000 Mumbai IT
8 Radhika  24.000 Nagpur Admin
9 Litika   24.000 Delhi  HR

In [143]:
arrange(df4, City,desc(Age))

  Names    Age    City   Dept
1 Litika   24.000 Delhi  HR
2 Nikita   22.000 Delhi  Finance
3 Ankit    20.000 Delhi  IT
4 Shubham  23.000 Mumbai HR
5 Prajakta 23.000 Mumbai IT
6 Vibhor   23.000 Mumbai IT
7 Radhika  24.000 Nagpur Admin
8 Raj      22.000 Noida  Finance
9 Hitesh   22.625 Pune   Operations

#### Filtering in DatFrame in R

#### 1) Find all records where city is Delhi

In [146]:
df4[df4$City=="Delhi",]

  Names  Age City  Dept
1 Ankit  20  Delhi IT
7 Nikita 22  Delhi Finance
9 Litika 24  Delhi HR

In [147]:
df4[df4$Age>=23,]

  Names    Age City   Dept
4 Shubham  23  Mumbai HR
5 Radhika  24  Nagpur Admin
6 Prajakta 23  Mumbai IT
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

#### Find all records where city in Delhi, Mumbai

In [149]:
df4[df4$City %in% c('Delhi','Mumbai'),]

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
4 Shubham  23  Mumbai HR
6 Prajakta 23  Mumbai IT
7 Nikita   22  Delhi  Finance
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

In [153]:
df4[which(df4$City %in% c("Delhi","Mumbai") | df4$Age > 23),]

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
4 Shubham  23  Mumbai HR
5 Radhika  24  Nagpur Admin
6 Prajakta 23  Mumbai IT
7 Nikita   22  Delhi  Finance
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

In [154]:
df4[which(df4$City %in% c("Delhi","Mumbai") & df4$Age >= 23),]

  Names    Age City   Dept
4 Shubham  23  Mumbai HR
6 Prajakta 23  Mumbai IT
8 Vibhor   23  Mumbai IT
9 Litika   24  Delhi  HR

#### Filter Using dyplyr

In [155]:
filter(df4, City == "Delhi" | Age >= 23)

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
2 Shubham  23  Mumbai HR
3 Radhika  24  Nagpur Admin
4 Prajakta 23  Mumbai IT
5 Nikita   22  Delhi  Finance
6 Vibhor   23  Mumbai IT
7 Litika   24  Delhi  HR

In [156]:
filter(df4, City == "Mumbai" & Age > 21)

  Names    Age City   Dept
1 Shubham  23  Mumbai HR
2 Prajakta 23  Mumbai IT
3 Vibhor   23  Mumbai IT

In [157]:
df4 %>% filter(City %in% c("Delhi","Mumbai") & Dept !="IT")

  Names   Age City   Dept
1 Shubham 23  Mumbai HR
2 Nikita  22  Delhi  Finance
3 Litika  24  Delhi  HR

In [158]:
df4 %>% filter(City %in% c("Delhi","Mumbai") & Dept =="IT")

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
2 Prajakta 23  Mumbai IT
3 Vibhor   23  Mumbai IT

In [160]:
subset(df4, Dept=="IT" | Age <= 22)

  Names    Age City   Dept
1 Ankit    20  Delhi  IT
2 Raj      22  Noida  Finance
6 Prajakta 23  Mumbai IT
7 Nikita   22  Delhi  Finance
8 Vibhor   23  Mumbai IT

#### Reading pre-loaded data from R

In [18]:
show(iris)

    Sepal.Length Sepal.Width Petal.Length Petal.Width    Species
1            5.1         3.5          1.4         0.2     setosa
2            4.9         3.0          1.4         0.2     setosa
3            4.7         3.2          1.3         0.2     setosa
4            4.6         3.1          1.5         0.2     setosa
5            5.0         3.6          1.4         0.2     setosa
6            5.4         3.9          1.7         0.4     setosa
7            4.6         3.4          1.4         0.3     setosa
8            5.0         3.4          1.5         0.2     setosa
9            4.4         2.9          1.4         0.2     setosa
10           4.9         3.1          1.5         0.1     setosa
11           5.4         3.7          1.5         0.2     setosa
12           4.8         3.4          1.6         0.2     setosa
13           4.8         3.0          1.4         0.1     setosa
14           4.3         3.0          1.1         0.1     setosa
15           5.8         4.0          1.2         0.2     setosa
16           5.7         4.4          1.5         0.4     setosa
17           5.4         3.9          1.3         0.4     setosa
18           5.1         3.5          1.4         0.3     setosa
19           5.7         3.8          1.7         0.3     setosa
20           5.1         3.8          1.5         0.3     setosa
21           5.4         3.4          1.7         0.2     setosa
22           5.1         3.7          1.5         0.4     setosa
23           4.6         3.6          1.0         0.2     setosa
24           5.1         3.3          1.7         0.5     setosa
25           4.8         3.4          1.9         0.2     setosa
26           5.0         3.0          1.6         0.2     setosa
27           5.0         3.4          1.6         0.4     setosa
28           5.2         3.5          1.5         0.2     setosa
29           5.2         3.4          1.4         0.2     setosa
30           4.7         3.2          1.6         0.2     setosa
31           4.8         3.1          1.6         0.2     setosa
32           5.4         3.4          1.5         0.4     setosa
33           5.2         4.1          1.5         0.1     setosa
34           5.5         4.2          1.4         0.2     setosa
35           4.9         3.1          1.5         0.2     setosa
36           5.0         3.2          1.2         0.2     setosa
37           5.5         3.5          1.3         0.2     setosa
38           4.9         3.6          1.4         0.1     setosa
39           4.4         3.0          1.3         0.2     setosa
40           5.1         3.4          1.5         0.2     setosa
41           5.0         3.5          1.3         0.3     setosa
42           4.5         2.3          1.3         0.3     setosa
43           4.4         3.2          1.3         0.2     setosa
44           5.0         3.5          1.6         0.6     setosa
45           5.1         3.8          1.9         0.4     setosa
46           4.8         3.0          1.4         0.3     setosa
47           5.1         3.8          1.6         0.2     setosa
48           4.6         3.2          1.4         0.2     setosa
49           5.3         3.7          1.5         0.2     setosa
50           5.0         3.3          1.4         0.2     setosa
51           7.0         3.2          4.7         1.4 versicolor
52           6.4         3.2          4.5         1.5 versicolor
53           6.9         3.1          4.9         1.5 versicolor
54           5.5         2.3          4.0         1.3 versicolor
55           6.5         2.8          4.6         1.5 versicolor
56           5.7         2.8          4.5         1.3 versicolor
57           6.3         3.3          4.7         1.6 versicolor
58           4.9         2.4          3.3         1.0 versicolor
59           6.6         2.9          4.6         1.3 versicolor
60           5.2         2.7          3.9         1.4 versicolor
61           5.0         2.0          3.5         1.0 versicolor
62           5.9         3.0          4.2         1.5 versicolor
63           6.0         2.2          4.0         1.0 versicolor
64           6.1         2.9          4.7         1.4 versicolor
65           5.6         2.9          3.6         1.3 versicolor
66           6.7         3.1          4.4         1.4 versicolor
67           5.6         3.0          4.5         1.5 versicolor
68           5.8         2.7          4.1         1.0 versicolor
69           6.2         2.2          4.5         1.5 versicolor
70           5.6         2.5          3.9         1.1 versicolor
71           5.9         3.2          4.8         1.8 versicolor
72           6.1         2.8          4.0         1.3 versicolor
73           6.3         2.5          4.9         1.5 versicolor
74           6.1         2.8          4.7         1.2 versicolor
75           6.4         2.9          4.3         1.3 versicolor
76           6.6         3.0          4.4         1.4 versicolor
77           6.8         2.8          4.8         1.4 versicolor
78           6.7         3.0          5.0         1.7 versicolor
79           6.0         2.9          4.5         1.5 versicolor
80           5.7         2.6          3.5         1.0 versicolor
81           5.5         2.4          3.8         1.1 versicolor
82           5.5         2.4          3.7         1.0 versicolor
83           5.8         2.7          3.9         1.2 versicolor
84           6.0         2.7          5.1         1.6 versicolor
85           5.4         3.0          4.5         1.5 versicolor
86           6.0         3.4          4.5         1.6 versicolor
87           6.7         3.1          4.7         1.5 versicolor
88           6.3         2.3          4.4         1.3 versicolor
89           5.6         3.0          4.1         1.3 versicolor
90           5.5         2.5          4.0         1.3 versicolor
91           5.5         2.6          4.4         1.2 versicolor
92           6.1         3.0          4.6         1.4 versicolor
93           5.8         2.6          4.0         1.2 versicolor
94           5.0         2.3          3.3         1.0 versicolor
95           5.6         2.7          4.2         1.3 versicolor
96           5.7         3.0          4.2         1.2 versicolor
97           5.7         2.9          4.2         1.3 versicolor
98           6.2         2.9          4.3         1.3 versicolor
99           5.1         2.5          3.0         1.1 versicolor
100          5.7         2.8          4.1         1.3 versicolor
101          6.3         3.3          6.0         2.5  virginica
102          5.8         2.7          5.1         1.9  virginica
103          7.1         3.0          5.9         2.1  virginica
104          6.3         2.9          5.6         1.8  virginica
105          6.5         3.0          5.8         2.2  virginica
106          7.6         3.0          6.6         2.1  virginica
107          4.9         2.5          4.5         1.7  virginica
108          7.3         2.9          6.3         1.8  virginica
109          6.7         2.5          5.8         1.8  virginica
110          7.2         3.6          6.1         2.5  virginica
111          6.5         3.2          5.1         2.0  virginica
112          6.4         2.7          5.3         1.9  virginica
113          6.8         3.0          5.5         2.1  virginica
114          5.7         2.5          5.0         2.0  virginica
115          5.8         2.8          5.1         2.4  virginica
116          6.4         3.2          5.3         2.3  virginica
117          6.5         3.0          5.5         1.8  virginica
118          7.7         3.8          6.7         2.2  virginica
119          7.7         2.6          6.9         2.3  virginica
120          6.0         2.2          5.0         1.5  virginica
121          6.9         3.2          5.7         2.3  virginica
122          5.6         2.8          4.9         2.0  virginica
123          7.7         2.8          6.7         2.0  virginica
124          6.3         2.7          4.9         1.8  virginica
125          6.7         3.3          5.7         2.1  virginica
126          7.2         3.2          6.0         1.8  virginica
127          6.2         2.8          4.8         1.8  virginica
128          6.1         3.0          4.9         1.8  virginica
129          6.4         2.8          5.6         2.1  virginica
130          7.2         3.0          5.8         1.6  virginica
131          7.4         2.8          6.1         1.9  virginica
132          7.9         3.8          6.4         2.0  virginica
133          6.4         2.8          5.6         2.2  virginica
134          6.3         2.8          5.1         1.5  virginica
135          6.1         2.6          5.6         1.4  virginica
136          7.7         3.0          6.1         2.3  virginica
137          6.3         3.4          5.6         2.4  virginica
138          6.4         3.1          5.5         1.8  virginica
139          6.0         3.0          4.8         1.8  virginica
140          6.9         3.1          5.4         2.1  virginica
141          6.7         3.1          5.6         2.4  virginica
142          6.9         3.1          5.1         2.3  virginica
143          5.8         2.7          5.1         1.9  virginica
144          6.8         3.2          5.9         2.3  virginica
145          6.7         3.3          5.7         2.5  virginica
146          6.7         3.0          5.2         2.3  virginica
147          6.3         2.5          5.0         1.9  virginica
148          6.5         3.0          5.2         2.0  virginica
149          6.2         3.4          5.4         2.3  virginica
150          5.9         3.0          5.1         1.8  virginica

In [161]:
head(iris$Sepal.Length,3)

[1] 5.1 4.9 4.7

In [162]:
levels(iris$Species)

[1] "setosa"     "versicolor" "virginica"